// ------------------------Завдання 1------------------------------
console.log(`--------Завдання 1----------`)
let i = 1;
while(i < 11) {
  console.log(i);
  i++;
}

// ------------------------Завдання 2------------------------------`
console.log(`--------Завдання 2----------`)
for(let i=2; i < 21; i++) {
  if(i % 2 !== 0) {
    continue;
  }
  console.log(i)
}


// ------------------------Завдання 3------------------------------`
console.log(`--------Завдання 3----------`)
for(i = 1; i<11; i++) {
  console.log(`7*${i} = ${i*7}`)
}

// ------------------------Завдання 4------------------------------`
console.log(`--------Завдання 4----------`)
let list = [1,2,3,4,5];
i = 0;
while(i < list.length) {
  console.log(list[i])
  i++;
}

// ------------------------Завдання 5------------------------------`
console.log(`--------Завдання 5----------`)
list = [1,2,3,4,5,6,7,8,9,10];
for(i=0; i<list.length; i++) {
  if(list[i] == 7) {
    console.log("Код стоп")
    break
  }

  console.log(list[i])
}

// ------------------------Завдання 6------------------------------`
console.log(`--------Завдання 6----------`)
let n = 8;
for(i=1; i < 10; i++) {
  if(i>= n) {
    break
  }
  console.log(i)
}

// ------------------------Завдання 7------------------------------`
console.log(`--------Завдання 7----------`)
i = 1;
while(i<= 20) {
  if(i%3 == 0) {
    i++
    continue;
  }

console.log(i)
i++
}